# frozen_string_literal: true

#     • При помощи класса OpenStruct создайте классы следующих боевых кораблей:
#     ◦ атомную подводную лодку (ракеты, торпеды);
#     ◦ ракетный крейсер (ракеты);
#     ◦ военный транспорт (грузовой трюм, кран).
# Создайте по три объекта каждого из классов, снабдив случайным количеством ракет и 
# торпед те корабли, которые могут их нести.
# Каждый из кораблей должен занимать одну клетку на игровом поле (размером 10×10). 
# Корабли не должны занимать клетку, в которой уже находится другой корабль.
